Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
static const struct gpio_dt_spec led = GPIO_DT_SPEC_GET_OR(DT_ALIAS(led0), gpios, {0});
static const struct device *const host_stream = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
static struct esb_payload rx_payload;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static struct esb_payload tx_payload;
static atomic_t tx_ready = ATOMIC_INIT(1);
static bool have_anchor;
static int32_t estimated_offset_us;
/* Set from ESB ISR when an OTA trigger arrives; main loop reboots. */
static atomic_t ota_reboot_pending = ATOMIC_INIT(0);

/* ── RF-sync instrumentation (Stage 1 per docs/RF.md) ──
 * Tag side. Histograms stay in RAM and get emitted in the SUMMARY line.
 * last_tx_local_us: local_us at the moment we queued the most recent
 *   ESB TX frame. Pair it against anchor RX time to see how quickly
 *   Hub's anchor came back.
 * anchor_age_bucket: distribution of (local_at_anchor_rx - last_tx_local_us)
 *   buckets [<2 ms, 2-10 ms, 10-30 ms, >=30 ms]. A bimodal distribution
 *   with most weight in bucket 0 means anchors mostly hit Hub's TIFS
 *   window; weight in buckets 2/3 means the slow-path is dominant.
 * offset_step_bucket: distribution of |new_offset - old_offset| across
 *   anchors — large jumps mean bad / stale anchors are corrupting the
 *   estimator (a key symptom of the shared-pipe cross-contamination). */
static volatile uint32_t last_tx_local_us;
static volatile uint32_t anchor_age_bucket[4];
static volatile uint32_t offset_step_bucket[4];
/* Stage 2 (v4 anchor): count anchors filtered out because rx_node_id
 * didn't match our own. Ratio of this to total anchors received tells
 * us how much shared-pipe cross-contamination we're rejecting. */
static volatile uint32_t anchors_wrong_rx;

/* Stage 3 (v5 anchor): per-Tag ring buffer of recent TXs, indexed by
 * Tag's own sequence number. On anchor RX, the Hub echoes back
 * frame->sequence in rx_frame_sequence; we look it up here to recover
 * the Tag-local TX timestamp for the midpoint estimator. Ring depth
 * 16 is well past any realistic Hub ACK-TX latency at 50 Hz (16 slots
 * × 20 ms per TX = 320 ms of history, vs. Stage 1' p99 ACK TX latency
 * of ~60 ms). See docs/RF.md. */
#define HELIX_TX_RING_SIZE   16u
#define HELIX_TX_RING_MASK   (HELIX_TX_RING_SIZE - 1u)
struct tx_stamp {
	uint8_t  sequence;
	uint8_t  valid;
	/* Stage 3.x retry instrumentation (v18): total TX attempts the
	 * ESB driver consumed before ACK. 0 on push; updated on
	 * TX_SUCCESS from esb_evt.tx_attempts. Tag has one frame in
	 * flight at a time (tx_ready), so the "just-ACK'd" frame is
	 * always the one most recently pushed into pending_tx_idx. */
	uint8_t  retry_count;
	uint32_t local_us;
};
static volatile struct tx_stamp tx_ring[HELIX_TX_RING_SIZE];
/* Monotonic write index; index & MASK is slot. Producer:
 * maybe_send_frame on successful esb_write_payload. Consumer:
 * node_handle_anchor (ESB ISR) — single reader, single writer,
 * no locking needed on nRF52 single-core. */
static volatile uint32_t tx_ring_head;
/* Ring slot of the most recent TX waiting on TX_SUCCESS / TX_FAILED.
 * Updated by maybe_send_frame; read by event_handler to back-fill
 * retry_count when the driver reports how many attempts it used. */
static volatile uint32_t pending_tx_idx;
static volatile uint8_t  pending_tx_valid;
/* Count of v5 anchors whose echoed sequence wasn't in the ring —
 * either too old (ring wrapped past it) or Hub echoed garbage.
 * Should be near-zero in steady state. */
static volatile uint32_t seq_lookup_miss;
/* Bucket midpoint-estimator jitter: |new_offset - prev_offset| for
 * the v5 midpoint estimator (separate from the old offset_step). */
static volatile uint32_t midpoint_step_bucket[4];
static volatile uint32_t midpoint_offset_valid;
/* volatile because this is published from the ESB ISR (node_handle_anchor)
 * and read from main thread in node_fill_frame() + maybe_send_frame().
 * On Cortex-M4 the 32-bit load/store is naturally atomic, but the
 * `volatile` qualifier pins the compiler-level contract. Always publish
 * `midpoint_offset_us` first, then `midpoint_offset_valid` (readers check
 * valid first, then the offset). */
static volatile int32_t midpoint_offset_us;
/* Retry-count distribution on ACCEPTED anchors (those that pass the
 * v4 rx_node_id gate). Buckets: 1, 2-3, 4-6, 7+. Answers "did the
 * Hub ACK on the first attempt or did we retry?"
 * And mid_step_by_retry[R][B] = count of accepted anchors where the
 * retry bucket was R and the midpoint-step bucket was B. Answers
 * "does the >=30ms residual tail correlate with high retry counts?"
 * (Round-6 reviewer consensus: prove or refute the retry-ambiguity
 * hypothesis with data before landing Stage 3.5.) */
static volatile uint32_t retry_count_bucket[4];
static volatile uint32_t mid_step_by_retry[4][4];

/* Stage 4 Path X1 — Tag-side TDMA slot scheduling.
 *
 * States:
 *   STAGE4_FREE      — free-running (no slot alignment). Default.
 *                      Transitions to CANDIDATE on first valid midpoint.
 *   STAGE4_CANDIDATE — midpoint is valid; counting consecutive stable
 *                      updates. Transitions to LOCKED after LOCK_N
 *                      updates where mid_step landed in bucket 0
 *                      (<2 ms). Any instability resets to FREE.
 *   STAGE4_LOCKED    — TX is slot-aligned. Dropped back to FREE on
 *                      seq_lookup_miss OR mid_step landing in bucket
 *                      2 or 3 (>=10 ms).
 *
 * See docs/RF_STAGE4_EXPLORATORY.md for the Path X1 rationale
 * (no separate broadcast beacon — anchors ARE beacons). */
#if defined(CONFIG_HELIX_STAGE4_TDMA_ENABLE)
enum stage4_state {
	STAGE4_FREE      = 0,
	STAGE4_CANDIDATE = 1,
	STAGE4_LOCKED    = 2,
};
static volatile uint8_t stage4_state_val = STAGE4_FREE;
static volatile uint32_t stage4_stable_count;
/* Telemetry — counted per event: */
static volatile uint32_t stage4_promotions;     /* FREE/CANDIDATE -> LOCKED */
static volatile uint32_t stage4_demotions;      /* LOCKED -> FREE */
static volatile uint32_t stage4_tx_in_slot;     /* TXed within slot guard */
static volatile uint32_t stage4_tx_skipped;     /* deferred; too far from slot */
#endif
#endif
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
static struct NodeTrack tracked_nodes[CONFIG_HELIX_MOCAP_MAX_TRACKED_NODES];
static uint8_t next_anchor_sequence;
/* When non-zero, the central injects an OTA trigger into the next ACK
 * payload for the target node (0xFF = broadcast). Cleared after send. */
static volatile uint8_t ota_trigger_target_node;
static volatile uint8_t ota_trigger_retries;
static volatile uint32_t ota_triggers_sent;

/* ── RF-sync instrumentation (Stage 1 per docs/RF.md) ──
 * Hub side. Measures whether Hub's anchor write makes the ~150 µs TIFS
 * window (fast path → anchor rides current frame's ACK, ~µs delay) or
 * misses it (slow path → anchor stays queued in pipe-0 FIFO and rides
 * a later frame's ACK, ~ms delay). Core measurement that turns the
 * "~70% slow path" hypothesis into a number.
 *
 * A naive single-slot last_queue_us has an asymmetric bias: when
 * several RX events fire before the oldest queued anchor's TX_SUCCESS
 * lands, the single slot gets overwritten and the oldest-anchor's
 * latency is measured against the newest queue time — either dropped
 * (negative delta) or compressed toward small buckets. That hides the
 * exact "old anchor waited behind a burst of RX" pattern we care
 * about. Fixed here with a FIFO ring matched against the ESB
 * ACK-payload TX FIFO. Both head and tail are only touched from the
 * ESB event-handler context (single-ISR execution in NCS v3.2.4), so
 * no locking is needed.
 *
 * Ring size: ESB_TX_FIFO_SIZE defaults to 8 in NCS; 16 leaves
 * headroom for any burst. Must be a power of 2 for the mask trick.
 * anchor_pending_max: observed peak FIFO depth (head - tail). */
#define HELIX_ANCHOR_QUEUE_RING   16u
#define HELIX_ANCHOR_QUEUE_MASK   (HELIX_ANCHOR_QUEUE_RING - 1u)
static_assert((HELIX_ANCHOR_QUEUE_RING & HELIX_ANCHOR_QUEUE_MASK) == 0u,
              "HELIX_ANCHOR_QUEUE_RING must be a power of 2");

static volatile uint32_t anchor_queue_ts_ring[HELIX_ANCHOR_QUEUE_RING];
static volatile uint32_t anchor_queue_ring_head;   /* next slot to write */
static volatile uint32_t anchor_queue_ring_tail;   /* next slot to consume */
static volatile uint32_t anchor_pending_max;
static volatile uint32_t ack_tx_latency_bucket[4];
static volatile uint32_t ack_tx_dropped_no_queue;  /* TX_SUCCESS with ring empty — diagnostic */

