Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
/* Request an OTA trigger for a specific node (or 0xFF = broadcast).
 * Sends the trigger on the next few FRAMEs from the target, then clears.
 * Called from the Hub relay when the PC requests a remote OTA trigger.
 *
 * Tear-down first, then arm. The ESB RX ISR reads ota_trigger_target_node
 * and ota_trigger_retries as an implicit pair; if we raced the two volatile
 * writes in the wrong order, the ISR could read the new target against the
 * old retries (or vice versa) and either send a stale flood or skip a new
 * one. Gate on target_node=0, barrier, then arm retries + target. The DMBs
 * force ordering on Cortex-M4 — cheap and sufficient since the ISR is on
 * the same core. (Copilot code review, 2026-04-20.) */
extern "C" void helix_request_ota_trigger(uint8_t node_id, uint8_t retries)
{
	ota_trigger_target_node = 0u;  /* gate: ISR ignores trigger during update */
	__DMB();
	ota_trigger_retries = retries;
	__DMB();
	ota_trigger_target_node = node_id;  /* arm */
}
#endif

static uint32_t now_us(void)
{
	return (uint32_t)(k_uptime_get() * 1000LL);
}

/* Bucket a µs-delta into 4 bins: [<2 ms, 2-10 ms, 10-30 ms, >=30 ms].
 * Used by the RF-sync instrumentation. Bumps bucket_arr[idx] and returns
 * the bucket index (0-3). Non-atomic — we accept occasional lost counts
 * from RX-ISR vs. main-thread races; instrumentation, not invariants. */
static inline uint32_t histo_bucket_us(uint32_t delta_us, volatile uint32_t *bucket_arr)
{
	uint32_t idx;
	if (delta_us < 2000u) idx = 0u;
	else if (delta_us < 10000u) idx = 1u;
	else if (delta_us < 30000u) idx = 2u;
	else idx = 3u;
	bucket_arr[idx]++;
	return idx;
}

static void status_set_error(int err)
{
	g_helixMocapStatus.last_error = (uint32_t)(err < 0 ? -err : err);
}

static int clocks_start(void)
{
	int err;
	int res;
	struct onoff_manager *clk_mgr;
	struct onoff_client clk_cli;

	clk_mgr = z_nrf_clock_control_get_onoff(CLOCK_CONTROL_NRF_SUBSYS_HF);
	if (clk_mgr == NULL) {
		return -ENXIO;
	}

	sys_notify_init_spinwait(&clk_cli.notify);
	err = onoff_request(clk_mgr, &clk_cli);
	if (err < 0) {
		return err;
	}

	do {
		err = sys_notify_fetch_result(&clk_cli.notify, &res);
		if (!err && res) {
			return res;
		}
	} while (err);

	return 0;
}

static void led_set(bool on)
{
	if (!gpio_is_ready_dt(&led)) {
		return;
	}

	(void)gpio_pin_set_dt(&led, on ? 1 : 0);
}

static void heartbeat_tick(void)
{
	static bool on;

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) && defined(CONFIG_HELIX_MOCAP_NODE_LED_DEBUG)
	uint32_t period_ms = 125U;

	if (have_anchor) {
		period_ms = 500U;
	} else if (g_helixMocapStatus.tx_success > 0U) {
		period_ms = 250U;
	}

	led_set(((now_us() / 1000U) / period_ms) & 1U);
#else
	on = !on;
	led_set(on);
#endif
	g_helixMocapStatus.heartbeat++;
}

static void host_write(const char *line)
{
	if (!device_is_ready(host_stream)) {
		return;
	}

	for (const char *p = line; *p != '\0'; ++p) {
		uart_poll_out(host_stream, (unsigned char)*p);
	}
}

static void report_summary(void)
{
	/* SUMMARY line can reach ~260 chars on node role with the Stage-1
	 * instrumentation buckets appended. Bump buffer accordingly. */
	char line[320];

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
	/* ack_lat: per-anchor FIFO-ring latency histogram. Buckets:
	 *   <2 ms / 2-10 ms / 10-30 ms / >=30 ms.
	 * pend_max: peak observed ESB ACK-payload FIFO depth since boot —
	 *   if this climbs, Hub is bursting queues beyond steady-state.
	 * ack_drop: TX_SUCCESS events with an empty ring (shouldn't happen
	 *   in principle; if nonzero we have a bookkeeping bug).
	 * See docs/RF.md Stage 1. */
	snprintk(line,
		 sizeof(line),
		 "SUMMARY role=central rx=%u anchors=%u tracked=%u usb_lines=%u err=%u hb=%u trigs=%u ack_lat=%u/%u/%u/%u pend_max=%u ack_drop=%u\n",
		 g_helixMocapStatus.rx_packets,
		 g_helixMocapStatus.anchors_sent,
		 g_helixMocapStatus.tracked_nodes,
		 g_helixMocapStatus.usb_lines,
		 g_helixMocapStatus.last_error,
		 g_helixMocapStatus.heartbeat,
		 ota_triggers_sent,
		 ack_tx_latency_bucket[0], ack_tx_latency_bucket[1],
		 ack_tx_latency_bucket[2], ack_tx_latency_bucket[3],
		 anchor_pending_max,
		 ack_tx_dropped_no_queue);
#else
	/* anchor_age buckets: how stale the most-recent anchor is vs. Tag's
	 * most-recent TX (proxy for Hub's ACK-path fast/slow distribution).
	 * offset_step buckets: |Δoffset| on each anchor (detects stale/wrong-
	 * Tag anchor corruption). See docs/RF.md */
	snprintk(line,
		 sizeof(line),
		 "SUMMARY role=node id=%u tx_ok=%u tx_fail=%u anchors=%u wrong_rx=%u "
		 "seq_miss=%u offset_us=%d mid_us=%d err=%u hb=%u "
		 "anchor_age=%u/%u/%u/%u offset_step=%u/%u/%u/%u "
		 "mid_step=%u/%u/%u/%u "
		 "retry=%u/%u/%u/%u "
#if defined(CONFIG_HELIX_STAGE4_TDMA_ENABLE)
		 "s4=%u/%u/%u/%u/%u"
#endif
		 "\n",
		 g_node_id,
		 g_helixMocapStatus.tx_success,
		 g_helixMocapStatus.tx_failed,
		 g_helixMocapStatus.anchors_received,
		 anchors_wrong_rx,
		 seq_lookup_miss,
		 g_helixMocapStatus.estimated_offset_us,
		 midpoint_offset_valid ? midpoint_offset_us : 0,
		 g_helixMocapStatus.last_error,
		 g_helixMocapStatus.heartbeat,
		 anchor_age_bucket[0], anchor_age_bucket[1],
		 anchor_age_bucket[2], anchor_age_bucket[3],
		 offset_step_bucket[0], offset_step_bucket[1],
		 offset_step_bucket[2], offset_step_bucket[3],
		 midpoint_step_bucket[0], midpoint_step_bucket[1],
		 midpoint_step_bucket[2], midpoint_step_bucket[3],
		 retry_count_bucket[0], retry_count_bucket[1],
		 retry_count_bucket[2], retry_count_bucket[3]
#if defined(CONFIG_HELIX_STAGE4_TDMA_ENABLE)
		 ,
		 (uint32_t)stage4_state_val,
		 stage4_promotions,
		 stage4_demotions,
		 stage4_tx_in_slot,
		 stage4_tx_skipped
#endif
		 );
#endif

	host_write(line);
}

#if defined(CONFIG_USB_DEVICE_STACK) || defined(CONFIG_USB_DEVICE_STACK_NEXT)
static int host_stream_init(void)
{
	if (!device_is_ready(host_stream)) {
		return -ENODEV;
	}

	return helix_usbd_enable(host_stream, CONFIG_HELIX_MOCAP_USB_WAIT_FOR_DTR_MS);
}
#else
static int host_stream_init(void)
{
	return device_is_ready(host_stream) ? 0 : -ENODEV;
}
#endif

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
static struct NodeTrack *find_or_add_track(uint8_t node_id)
{
	struct NodeTrack *free_slot = NULL;

	for (size_t i = 0; i < ARRAY_SIZE(tracked_nodes); ++i) {
		if (tracked_nodes[i].active && tracked_nodes[i].node_id == node_id) {
			return &tracked_nodes[i];
		}
		if (!tracked_nodes[i].active && free_slot == NULL) {
			free_slot = &tracked_nodes[i];
		}
	}

