Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
static void event_handler(struct esb_evt const *event)
{
	switch (event->evt_id) {
	case ESB_EVENT_TX_SUCCESS:
		g_helixMocapStatus.tx_success++;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
		/* Hub (PRX) TX_SUCCESS fires when a queued ACK payload (the
		 * anchor built in central_handle_frame) has been successfully
		 * transmitted. Pull the OLDEST queue timestamp off the ring —
		 * that's the anchor this TX_SUCCESS just delivered — and
		 * bucket the latency. Ring semantics: head is bumped on each
		 * enqueue in central_handle_frame; tail advances here on each
		 * successful TX. Both run from the same ESB ISR context in
		 * NCS v3.2.4, so no locking. */
		{
			const uint32_t tx_done_us = now_us();
			const uint32_t tail = anchor_queue_ring_tail;
			const uint32_t head = anchor_queue_ring_head;
			if (tail != head) {
				const uint32_t queue_us =
					anchor_queue_ts_ring[tail & HELIX_ANCHOR_QUEUE_MASK];
				anchor_queue_ring_tail = tail + 1u;
				if (tx_done_us >= queue_us) {
					(void)histo_bucket_us(tx_done_us - queue_us,
					                      ack_tx_latency_bucket);
				}
			} else {
				ack_tx_dropped_no_queue++;
			}
		}
#endif
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
		/* Tag side — the ACK just came back. Back-fill the retry_count
		 * into the tx_ring entry that matched this TX so the matching
		 * anchor (which we may have already or may be about to handle)
		 * can be bucketed by retry count. See mid_step_by_retry. */
		if (pending_tx_valid) {
			tx_ring[pending_tx_idx].retry_count = event->tx_attempts;
			pending_tx_valid = 0u;
		}
		atomic_set(&tx_ready, 1);
#endif
		break;
	case ESB_EVENT_TX_FAILED:
		g_helixMocapStatus.tx_failed++;
		(void)esb_flush_tx();
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
		/* Same logic as TX_SUCCESS — but TX_FAILED means we exhausted
		 * retries without an ACK, so the retry_count goes to max.
		 * Anchor will never arrive for this sequence; clear pending. */
		if (pending_tx_valid) {
			tx_ring[pending_tx_idx].retry_count = event->tx_attempts;
			pending_tx_valid = 0u;
		}
		atomic_set(&tx_ready, 1);
#endif
		break;
	case ESB_EVENT_RX_RECEIVED:
		while (esb_read_rx_payload(&rx_payload) == 0) {
			g_helixMocapStatus.rx_packets++;
			g_helixMocapStatus.last_rx_len = rx_payload.length;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
			central_handle_frame(&rx_payload);
#else
			node_handle_anchor(&rx_payload);
#endif
		}
		break;
	default:
		break;
	}
}

static int esb_initialize(void)
{
	int err;
	uint8_t base_addr_0[4] = {0xD3, 0xC1, 0xB2, 0xA1};
	uint8_t base_addr_1[4] = {0x44, 0x33, 0x22, 0x11};
	uint8_t addr_prefix[8] = {0xE7, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8};
	struct esb_config config = ESB_DEFAULT_CONFIG;

	config.protocol = ESB_PROTOCOL_ESB_DPL;
	config.bitrate = ESB_BITRATE_2MBPS;
	config.event_handler = event_handler;
	/* Per-Tag retransmit_delay spread so when two Tags collide their
	 * retries land at different times. 600 µs base + 50 µs × node_id
	 * gives 650 µs (node 1) through 1100 µs (node 10) — 450 µs spread.
	 * Hub (central) stays at the base value because PRX doesn't retry
	 * on collision anyway. */
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
	config.retransmit_delay = static_cast<uint16_t>(600u + (uint16_t)g_node_id * 50u);
#else
	config.retransmit_delay = 600;
#endif
	/* retransmit_count 6 → 10: with 10 Tags on pipe 0 a chunk is up
	 * against ~9 other Tags for any given air slot; more retries
	 * compensates for the elevated collision rate (Phase A baseline
	 * showed 38-46 Hz / Tag vs 50 Hz target, i.e. 12-24 % loss). */
	config.retransmit_count = 10;
	config.selective_auto_ack = true;
	config.payload_length = 32;
	config.mode =
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
		ESB_MODE_PRX;
#else
		ESB_MODE_PTX;
#endif

	err = esb_init(&config);
	if (err) {
		return err;
	}

	err = esb_set_base_address_0(base_addr_0);
	if (err) {
		return err;
	}

	err = esb_set_base_address_1(base_addr_1);
	if (err) {
		return err;
	}

	err = esb_set_prefixes(addr_prefix, ARRAY_SIZE(addr_prefix));
	if (err) {
		return err;
	}

	err = esb_set_rf_channel(CONFIG_HELIX_MOCAP_RF_CHANNEL);
	if (err) {
		return err;
	}

	(void)esb_flush_tx();
	(void)esb_flush_rx();
	return 0;
}

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static void maybe_send_frame(void)
{
	struct HelixMocapFrame frame;
	int err;

	if (!atomic_cas(&tx_ready, 1, 0)) {
		return;
	}

#if defined(CONFIG_HELIX_STAGE4_TDMA_ENABLE)
	/* Compile-time invariant: with 10 Tags sharing pipe 0, the fleet
	 * must fit inside one cycle. CONFIG_HELIX_MOCAP_MAX_TRACKED_NODES
	 * is the Hub-side limit; we use it as the authoritative Tag count.
	 * If the user misconfigures, the build fails rather than producing
	 * runtime slot overlaps. (Codex code review round 7.) */
	static_assert(CONFIG_HELIX_MOCAP_MAX_TRACKED_NODES *
	              CONFIG_HELIX_STAGE4_SLOT_US
	              <= CONFIG_HELIX_STAGE4_CYCLE_US,
	              "Stage 4: N_Tags * SLOT_US must fit in one CYCLE_US");
	/* Stage 4 Path X1: if we're LOCKED, align TX to our TDMA slot.
	 * Hub-time "now" = Tag local_us - midpoint_offset_us. Slot start
	 * = (node_id - 1) × SLOT_US in Hub-time. ALWAYS wait for the
	 * next slot — NEVER skip. Skipping is a trap: the main loop's
	 * 20 ms cadence equals the cycle period, so if we land just past
	 * our slot once we'd skip forever. Always sleep forward 0..CYCLE
	 * µs and TX at the slot instant. */
	if (stage4_state_val == STAGE4_LOCKED &&
	    g_node_id >= 1u &&
	    g_node_id <= CONFIG_HELIX_MOCAP_MAX_TRACKED_NODES) {
		const uint32_t now_tag = now_us();
		const uint32_t now_hub = now_tag - (uint32_t)midpoint_offset_us;
		const uint32_t cycle_phase = now_hub % (uint32_t)CONFIG_HELIX_STAGE4_CYCLE_US;
		const uint32_t my_slot_start =
			(uint32_t)(g_node_id - 1u) * (uint32_t)CONFIG_HELIX_STAGE4_SLOT_US;
		/* Current-cycle delay: if we're before slot, delta > 0; if
		 * past the slot end, wrap to next cycle's slot. */
		uint32_t delay_us;
		if (cycle_phase <= my_slot_start + (uint32_t)CONFIG_HELIX_STAGE4_GUARD_US) {
			delay_us = (my_slot_start > cycle_phase)
				? (my_slot_start - cycle_phase) : 0u;
		} else {
			delay_us = (uint32_t)CONFIG_HELIX_STAGE4_CYCLE_US
			         - cycle_phase + my_slot_start;
		}
		if (delay_us > 0u) {
			k_usleep(delay_us);
		}
		stage4_tx_in_slot++;
	}
#endif

	node_fill_frame(&frame);
	tx_payload.pipe = CONFIG_HELIX_MOCAP_PIPE;
	tx_payload.noack = 0;
	tx_payload.length = sizeof(frame);
	memcpy(tx_payload.data, &frame, sizeof(frame));

	g_helixMocapStatus.last_sequence = frame.sequence;
	g_helixMocapStatus.last_node_id = frame.node_id;
	g_helixMocapStatus.tx_attempts++;

	/* Stage 3.6: push to the seq-indexed ring BEFORE esb_write_payload
	 * so the anchor ISR (which can fire as soon as Hub's ACK returns)
	 * always sees the matching TX entry. Publishing order matters on
	 * single-core nRF52 — valid=1 store must come last so a racing
	 * reader sees either "not here yet" or "fully populated." */
	const uint32_t tx_us = now_us();
	const uint32_t head_pre = tx_ring_head;
	const uint32_t idx = head_pre & HELIX_TX_RING_MASK;
	tx_ring[idx].sequence    = frame.sequence;
	tx_ring[idx].local_us    = tx_us;
	tx_ring[idx].retry_count = 0u;  /* filled in from TX_SUCCESS */
	__DMB(); /* ensure sequence/local_us are visible before valid=1 */
	tx_ring[idx].valid    = 1u;
	tx_ring_head = head_pre + 1u;
	last_tx_local_us = tx_us;
	/* Record the in-flight ring slot so TX_SUCCESS can back-fill the
	 * retry_count (esb_evt.tx_attempts). Only one frame in flight at
	 * a time (tx_ready atomic), so we just remember the most recent. */
	pending_tx_idx = idx;
	pending_tx_valid = 1u;

