Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
	err = esb_write_payload(&tx_payload);
	if (err) {
		status_set_error(err);
		atomic_set(&tx_ready, 1);
		/* Unwind the ring entry — the anchor for this seq will never
		 * come back because the TX failed. Leaving it valid could
		 * give a false-match to a later anchor that happens to echo
		 * the same sequence byte (seq wraps every 256). */
		tx_ring[idx].valid = 0u;
		tx_ring_head = head_pre;
		pending_tx_valid = 0u;
	}
}
#endif

/* ── BLE OTA Boot Window (node role only) ──────────────────────── */
#if defined(CONFIG_BT) && defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) && \
    (CONFIG_HELIX_OTA_BOOT_WINDOW_MS > 0)

#define BT_UUID_HELIX_OTA_SERVICE_VAL \
    BT_UUID_128_ENCODE(0x3ef6a001, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)
#define BT_UUID_HELIX_OTA_CTRL_VAL \
    BT_UUID_128_ENCODE(0x3ef6a002, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)
#define BT_UUID_HELIX_OTA_DATA_VAL \
    BT_UUID_128_ENCODE(0x3ef6a003, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)
#define BT_UUID_HELIX_OTA_STATUS_VAL \
    BT_UUID_128_ENCODE(0x3ef6a004, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)

static struct bt_uuid_128 ota_svc_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_SERVICE_VAL);
static struct bt_uuid_128 ota_ctrl_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_CTRL_VAL);
static struct bt_uuid_128 ota_data_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_DATA_VAL);
static struct bt_uuid_128 ota_status_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_STATUS_VAL);

static helix::ZephyrOtaFlashBackend ota_backend;
static helix::OtaManager ota_manager{ota_backend};
static helix::OtaManagerAdapter ota_adapter{ota_manager};
static helix::BleOtaService ota_service{ota_adapter, CONFIG_HELIX_OTA_TARGET_ID};

static struct bt_conn *ota_conn;
static bool ota_connected;

static volatile bool ota_commit_pending;

/* Deferred BEGIN: flash erase takes ~10s and would block the BLE stack
 * if run inside the GATT callback, causing supervision timeout. Instead,
 * we save the BEGIN parameters and process them in the main OTA loop. */
static volatile bool ota_begin_pending;
static uint8_t ota_begin_buf[16];
static uint16_t ota_begin_len;

static ssize_t ota_write_ctrl(struct bt_conn *, const struct bt_gatt_attr *,
                              const void *buf, uint16_t len, uint16_t, uint8_t)
{
	const auto *data = static_cast<const uint8_t *>(buf);

	/* Defer BEGIN (cmd=0x01) to the main loop — flash erase is too slow
	 * to run inside the GATT callback. But validate payload *here* so we
	 * can NACK immediately on bad target_id or short payload; otherwise
	 * the uploader would think BEGIN succeeded and poll STATUS forever
	 * while the main-loop handleControlWrite silently rejects. */
	if (len > 0 && data[0] == helix::BleOtaService::CMD_BEGIN) {
		if (len < helix::BleOtaService::kCtrlBeginMinLen ||
		    len > sizeof(ota_begin_buf)) {
			return BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
		}
		/* Validate target_id before accepting.
		 * Layout: [cmd:1][size:4][crc:4][tid:4] — target_id at offset 9..12.
		 * kCtrlBeginMinLen is 13, so the len check above guarantees data[9..12]
		 * are in bounds; static_assert pins the relationship so a future
		 * refactor can't silently break it. */
		static_assert(helix::BleOtaService::kCtrlBeginMinLen >= 13u,
		              "BEGIN payload must be at least 13 bytes for target_id at offset 9..12");
		uint32_t req_tid;
		memcpy(&req_tid, &data[9], sizeof(req_tid));
		if (req_tid != (uint32_t)CONFIG_HELIX_OTA_TARGET_ID) {
			/* Audible failure. Previously this returned silently; if an
			 * uploader ever targets a mixed-firmware fleet with the wrong
			 * --target-id, the only symptom was a GATT NACK from here
			 * with no clue which side was off. */
			printk("ota: BEGIN rejected — target_id 0x%08x != expected 0x%08x\n",
			       (unsigned)req_tid,
			       (unsigned)CONFIG_HELIX_OTA_TARGET_ID);
			return BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
		}
		memcpy(ota_begin_buf, data, len);
		ota_begin_len = len;
		ota_begin_pending = true;
		return static_cast<ssize_t>(len); /* ACK, main loop does erase */
	}

	auto status = ota_service.handleControlWrite(data, len);
	if (status == helix::OtaStatus::OK &&
	    ota_manager.state() == helix::OtaState::COMMITTED) {
		ota_commit_pending = true;
	}
	return status == helix::OtaStatus::OK
	       ? static_cast<ssize_t>(len)
	       : BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
}

static ssize_t ota_write_data(struct bt_conn *, const struct bt_gatt_attr *,
                              const void *buf, uint16_t len, uint16_t, uint8_t)
{
	auto status = ota_service.handleDataWrite(static_cast<const uint8_t *>(buf), len);
	return status == helix::OtaStatus::OK
	       ? static_cast<ssize_t>(len)
	       : BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
}

static ssize_t ota_read_status(struct bt_conn *, const struct bt_gatt_attr *attr,
                               void *buf, uint16_t len, uint16_t offset)
{
	uint8_t status[helix::BleOtaService::kStatusLen] = {};
	size_t slen = 0;
	ota_service.getStatus(status, &slen);
	return bt_gatt_attr_read(nullptr, attr, buf, len, offset, status, slen);
}

BT_GATT_SERVICE_DEFINE(helix_ota_svc,
    BT_GATT_PRIMARY_SERVICE(&ota_svc_uuid),
    BT_GATT_CHARACTERISTIC(&ota_ctrl_uuid.uuid,
                           BT_GATT_CHRC_WRITE,
                           BT_GATT_PERM_WRITE,
                           nullptr, ota_write_ctrl, nullptr),
    BT_GATT_CHARACTERISTIC(&ota_data_uuid.uuid,
                           BT_GATT_CHRC_WRITE | BT_GATT_CHRC_WRITE_WITHOUT_RESP,
                           BT_GATT_PERM_WRITE,
                           nullptr, ota_write_data, nullptr),
    BT_GATT_CHARACTERISTIC(&ota_status_uuid.uuid,
                           BT_GATT_CHRC_READ,
                           BT_GATT_PERM_READ,
                           ota_read_status, nullptr, nullptr),
);

static void ota_bt_connected(struct bt_conn *conn, uint8_t err)
{
	if (err == 0 && !ota_conn) {
		ota_conn = bt_conn_ref(conn);
		ota_connected = true;
		printk("ota: connected\n");
	}
}

static void ota_bt_disconnected(struct bt_conn *conn, uint8_t reason)
{
	if (ota_conn == conn) {
		bt_conn_unref(ota_conn);
		ota_conn = nullptr;
		ota_connected = false;
		printk("ota: disconnected reason=%u\n", reason);
	}
}

