Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
BT_CONN_CB_DEFINE(ota_conn_cbs) = {
    .connected = ota_bt_connected,
    .disconnected = ota_bt_disconnected,
};

/* Run the BLE OTA boot window. Returns true if OTA completed (reboot
 * happens inside), false if the window expired with no connection. */
static bool run_ota_boot_window(void)
{
	printk("ota: boot window %d ms\n", CONFIG_HELIX_OTA_BOOT_WINDOW_MS);
	g_helixMocapStatus.last_error = 0xBB01U; /* entered OTA window */

	if (boot_write_img_confirmed() == 0) {
		printk("mcuboot: image confirmed\n");
	}
	g_helixMocapStatus.last_error = 0xBB02U; /* img confirmed */

	if (!ota_backend.init()) {
		printk("ota: backend init failed\n");
		g_helixMocapStatus.last_error = 0xBBFEU;
		return false;
	}
	g_helixMocapStatus.last_error = 0xBB03U; /* backend init ok */

	/* Pre-bt_enable settle delay. On fast back-to-back reboots (OTA +
	 * warm-ish NVIC reset), the SoftDevice Controller's LF clock /
	 * MPSL calibration hasn't re-converged, and the first connection
	 * after bt_enable() drops with supervision-timeout (reason=8)
	 * within ~3 s — consistent with LFRC drift accumulating to a full
	 * connection-interval miss. 2 s fixed 4/5 cycles; cycle 5 failed
	 * the same way deterministically (including an automatic retry),
	 * suggesting the die has warmed across prior OTAs and LFRC has
	 * drifted further from the cold-boot calibration point. 4 s gives
	 * MPSL enough time to re-converge even on a warm chip. */
	k_sleep(K_MSEC(4000));

	int err = bt_enable(nullptr);
	if (err) {
		printk("ota: bt_enable failed %d\n", err);
		g_helixMocapStatus.last_error = 0xBB00U | (uint32_t)(unsigned)(-err);
		return false;
	}
	g_helixMocapStatus.last_error = 0xBB04U; /* bt_enable ok */

	/* Build unique name from FICR */
	{
		const auto ficr0 = *reinterpret_cast<const volatile uint32_t *>(0x100000A4U);
		static const char hex[] = "0123456789ABCDEF";
		char name[16];
		const char *base = CONFIG_BT_DEVICE_NAME;
		size_t n = strlen(base);
		memcpy(name, base, n);
		name[n]     = '-';
		name[n + 1] = hex[(ficr0 >>  4) & 0xF];
		name[n + 2] = hex[ ficr0        & 0xF];
		name[n + 3] = hex[(ficr0 >> 12) & 0xF];
		name[n + 4] = hex[(ficr0 >>  8) & 0xF];
		name[n + 5] = '\0';
		bt_set_name(name);
		printk("ota: name %s\n", name);
	}

	/* Read our own MCUboot image version from the active slot */
	struct mcuboot_img_header img_hdr = {};
	uint8_t app_major = 0, app_minor = 0;
	uint16_t app_rev = 0;
	uint32_t app_build = 0;
	if (boot_read_bank_header(FIXED_PARTITION_ID(slot0_partition),
	                          &img_hdr, sizeof(img_hdr)) == 0 &&
	    img_hdr.mcuboot_version == 1) {
		app_major = img_hdr.h.v1.sem_ver.major;
		app_minor = img_hdr.h.v1.sem_ver.minor;
		app_rev = img_hdr.h.v1.sem_ver.revision;
		app_build = img_hdr.h.v1.sem_ver.build_num;
	}
	printk("ota: app v%u.%u.%u+%u\n", app_major, app_minor, app_rev, app_build);

	/* Build advertising data — use static storage so pointers persist */
	const char *bt_name = bt_get_name();
	static uint8_t adv_flags[] = {BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR};

	/* Manufacturer-specific data carrying versions.
	 * Layout: [company_id_lo][company_id_hi] [tag='H'][payload_ver=1]
	 *         [app_major][app_minor][app_rev_lo][app_rev_hi]
	 *         [boot_major][boot_minor][boot_rev_lo][boot_rev_hi]
	 * Total: 12 bytes payload (build_num dropped for BLE fit).
	 * Adv budget: flags(3) + name "HTag-XXXX"(11) + mfg(14) = 28 / 31 bytes. */
	static uint8_t mfg_data[12];
	mfg_data[0] = 0xFF; mfg_data[1] = 0xFF;  /* local-use company id */
	mfg_data[2] = 'H';                        /* magic — 'H'elix advert marker */
	mfg_data[3] = 0x01;                       /* payload version */
	mfg_data[4] = app_major;
	mfg_data[5] = app_minor;
	mfg_data[6] = app_rev & 0xFF;
	mfg_data[7] = (app_rev >> 8) & 0xFF;
	mfg_data[8]  = CONFIG_HELIX_BOOTLOADER_VERSION_MAJOR;
	mfg_data[9]  = CONFIG_HELIX_BOOTLOADER_VERSION_MINOR;
	mfg_data[10] = CONFIG_HELIX_BOOTLOADER_VERSION_REVISION & 0xFF;
	mfg_data[11] = (CONFIG_HELIX_BOOTLOADER_VERSION_REVISION >> 8) & 0xFF;

	static struct bt_data ad[3];
	ad[0] = {BT_DATA_FLAGS, sizeof(adv_flags), adv_flags};
	ad[1] = {BT_DATA_NAME_COMPLETE, static_cast<uint8_t>(strlen(bt_name)),
	         reinterpret_cast<const uint8_t *>(bt_name)};
	ad[2] = {BT_DATA_MANUFACTURER_DATA, sizeof(mfg_data), mfg_data};

	err = bt_le_adv_start(BT_LE_ADV_CONN_FAST_1, ad, 3, nullptr, 0);
	if (err) {
		printk("ota: adv start failed %d\n", err);
		g_helixMocapStatus.last_error = 0xBBA0U | (uint32_t)(unsigned)(-err);
		bt_disable();
		return false;
	}
	g_helixMocapStatus.last_error = 0xBB05U; /* adv start ok */

	/* Wait for connection or timeout */
	int64_t deadline = k_uptime_get() + CONFIG_HELIX_OTA_BOOT_WINDOW_MS;
	while (k_uptime_get() < deadline && !ota_connected) {
		led_set(((k_uptime_get() / 100) & 1) != 0); /* fast blink = OTA window */
		k_sleep(K_MSEC(50));
	}

	if (!ota_connected) {
		printk("ota: window expired, switching to ESB\n");
		g_helixMocapStatus.last_error = 0xBB06U; /* window expired */
		bt_le_adv_stop();
		bt_disable();
		return false;
	}

	/* Connected — run OTA until complete or disconnect.
	 * Commit is deferred from the GATT callback to avoid flash writes
	 * interfering with BLE timing. The ota_commit_pending flag signals
	 * that commit succeeded and we should reboot.
	 *
	 * Three timeout guards:
	 *   1. Stall detector (existing): 30 s of no byte progress while in
	 *      RECEIVING state → force disconnect.
	 *   2. Idle-connection timeout (new, 60 s): peer connected but never
	 *      sent BEGIN (state stays IDLE). Prevents the Tag getting stuck
	 *      forever when a phantom connection never sees its disconnect
	 *      callback fire (observed on the J-Link-attached Tag where SWD
	 *      halt events suppressed MPSL's link-layer teardown — but can
	 *      also hit any Tag if the peer vanishes at the wrong moment).
	 *   3. Hard session ceiling (new, 300 s): no single OTA session should
	 *      ever exceed 5 minutes regardless of state. Belt-and-braces for
	 *      the case where ota_connected is stuck true but neither the
	 *      stall nor idle guard fires (e.g. oscillating between states).
	 * Any of these triggers bt_conn_disconnect which clears ota_connected
	 * via the disconnect callback; the loop then exits cleanly to ESB.
	 * If the disconnect callback itself is ever suppressed, loop still
	 * exits because we `break` immediately after issuing the disconnect. */
	printk("ota: running OTA transfer\n");
	const int64_t session_start = k_uptime_get();
	uint32_t last_bytes = 0;
	uint32_t stall_ticks = 0;
	uint32_t idle_ticks = 0;
	while (ota_connected) {
		/* Deferred BEGIN: run flash erase in the main loop where it
		 * won't block the BLE stack's connection event processing. */
		if (ota_begin_pending) {
			printk("ota: begin (deferred erase)\n");
			auto status = ota_service.handleControlWrite(ota_begin_buf, ota_begin_len);
			printk("ota: begin status=%d\n", static_cast<int>(status));
			ota_begin_pending = false;
		}
		if (ota_commit_pending) {
			printk("ota: commit done, rebooting\n");
			k_sleep(K_MSEC(CONFIG_HELIX_OTA_REBOOT_DELAY_MS));
			sys_reboot(SYS_REBOOT_COLD);
		}
		/* Hard session ceiling — 300 s max. */
		if ((k_uptime_get() - session_start) > 300000LL) {
			printk("ota: session ceiling (300s) hit, disconnecting\n");
			if (ota_conn) {
				bt_conn_disconnect(ota_conn, BT_HCI_ERR_REMOTE_USER_TERM_CONN);
			}
			break;
		}
		uint32_t bytes = ota_manager.bytesReceived();
		const auto ota_state = ota_manager.state();
		if (ota_state == helix::OtaState::RECEIVING) {
			idle_ticks = 0;
			if (bytes == last_bytes) {
				stall_ticks++;
			} else {
				stall_ticks = 0;
				last_bytes = bytes;
			}
			if (stall_ticks >= 600) { /* 600 * 50ms = 30s */
				printk("ota: stall, disconnecting\n");
				bt_conn_disconnect(ota_conn, BT_HCI_ERR_REMOTE_USER_TERM_CONN);
				break;
			}
		} else if (ota_state == helix::OtaState::IDLE && !ota_begin_pending) {
			/* Idle-connection guard — peer connected but never sent
			 * a BEGIN (or disconnect callback never fired on a
			 * phantom peer). */
			if (++idle_ticks >= 1200) { /* 1200 * 50ms = 60s */
				printk("ota: idle connection (60s no BEGIN), disconnecting\n");
				if (ota_conn) {
					bt_conn_disconnect(ota_conn, BT_HCI_ERR_REMOTE_USER_TERM_CONN);
				}
				break;
			}
		} else {
			idle_ticks = 0;
		}
		led_set(((k_uptime_get() / 250) & 1) != 0); /* medium blink = OTA active */
		k_sleep(K_MSEC(50));
	}
	/* Check commit after disconnect too (commit might have set flag just as connection dropped) */
	if (ota_commit_pending) {
		printk("ota: commit done (post-disconnect), rebooting\n");
		k_sleep(K_MSEC(CONFIG_HELIX_OTA_REBOOT_DELAY_MS));
		sys_reboot(SYS_REBOOT_COLD);
	}

